<?php

use Illuminate\Database\Seeder;

class UserWalletInfoSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // 用户钱包表
        $data = [
            ['6', '2', '0.0000', '0.0000', '5200.0000', '2017-09-11 16:17:17', '2017-09-14 09:35:52'],
            ['8', '4', '0.0000', '0.0000', '5600.0000', '2017-08-29 00:00:00', '2017-08-29 00:00:00'],
            ['9', '5', '0.0000', '0.0000', '5600.0000', '2017-08-29 00:00:00', '2017-08-29 00:00:00'],
            ['26', '6', '0.0000', '0.0000', '5400.0000', '2017-09-01 14:03:53', '2017-09-15 11:12:35'],
            ['54', '1', '0.0000', '0.0000', '5000.0000', '2017-09-15 18:10:48', '2017-09-15 18:10:48'],
        ];

        $field = ['wallet_id','user_id','user_money','frozen_money','white_money','created_at','updated_at'];

        DB::table('user_wallet')->insert(sql_batch_str($field,$data));
        unset($data);unset($field);

        // 用户钱包详细表
        $data = [
            ['161', '2', '-200.0000', '0.0000', '5400.0000', '1', '1', '2017-09-13 15:06:47', '2017-09-13 15:06:47', null],
            ['183', '2', '-200.0000', '0.0000', '5200.0000', '1', '1', '2017-09-14 09:35:52', '2017-09-14 09:35:52', null],
            ['248', '6', '-200.0000', '0.0000', '5400.0000', '1', '1', '2017-09-15 11:12:35', '2017-09-15 11:12:35', null],
            ['271', '1', '5000.0000', '0.0000', '5000.0000', '1', '2', '2017-09-15 18:10:48', '2017-09-15 18:10:48', null],
        ];

        $field = ['id','user_id','change_money','surplus_money','surplus_white_money','type','status','created_at','updated_at','deleted_at'];

        DB::table('user_wallet_detail')->insert(sql_batch_str($field,$data));
    }
}
